app/views/welcome/index.html.erb

SELECT "preferences".* FROM "preferences" WHERE "preferences"."setting" = $1 LIMIT $2  [["setting", "homepage_title"], ["LIMIT", 1]]
---
<%= render 'layouts/card', heading: Preference.find_by(setting: "homepage_title").value, body: Preference.find_by(setting: "homepage_body").value.html_safe %>