app/controllers/application_controller.rb

SELECT "categories".* FROM "categories"
---
  def set_categories
    @categories = Category.all.sort_by &:title