app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"
---
  def index
    add_breadcrumb "Products", products_path, :title => "Products"

    @categories = Category.page(params[:page])

SELECT "products".* FROM "products" INNER JOIN "product_categories" ON "products"."id" = "product_categories"."product_id" WHERE "product_categories"."category_id" = $1  [["category_id", 200]]
SELECT COUNT(*) FROM "products" INNER JOIN "product_categories" ON "products"."id" = "product_categories"."product_id" WHERE "product_categories"."category_id" = $1  [["category_id", 200]]
SELECT "products".* FROM "products" INNER JOIN "product_categories" ON "products"."id" = "product_categories"."product_id" WHERE "product_categories"."category_id" = $1 LIMIT $2 OFFSET $3  [["category_id", 200], ["LIMIT", 25], ["OFFSET", 0]]
---
  def show
    if @category.products.present?
      # @category_products = @category.products.sort_by &:title
      @category_products = @category.products.page(params[:page])