app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "sku", "description", "price", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Test"], ["sku", "sku123"], ["description", "Test desc"], ["price", "12.0"], ["quantity", 2], ["created_at", "2022-11-14 21:53:00.243606"], ["updated_at", "2022-11-14 21:53:00.243606"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "quantity" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["quantity", 22], ["updated_at", "2022-11-14 21:53:04.313340"], ["id", 1]]