app/controllers/products_controller.rb

  def index
    add_breadcrumb "Products", products_path, :title => "Products"

    @products = Product.page(params[:page])
---
SELECT "products".* FROM "products" LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"

  def show

    if @product.categories.present?
---
SELECT "categories".* FROM "categories" INNER JOIN "product_categories" ON "categories"."id" = "product_categories"."category_id" WHERE "product_categories"."product_id" = $1  [["product_id", 506]]