app/controllers/sales_orders_controller.rb

SELECT "sales_orders".* FROM "sales_orders"
---
  def index
    @sales_orders = SalesOrder.all