app/controllers/welcome_controller.rb

SELECT "products".* FROM "products" LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
---
  def index
    @products = Product.page(params[:page])