app/views/products/_product.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "product_categories" ON "categories"."id" = "product_categories"."category_id" WHERE "product_categories"."product_id" = $1  [["product_id", 506]]
---
          <h5 class="card-title"><%= product.title %></h5>
          <% product.categories.each do |category| %>