app/views/layouts/_footer.html.erb

          <li>
            <i class="fa-solid fa-store"></i> <%= Preference.find_by(setting: "company_name").value %></li>
          <li><%= Preference.find_by(setting: "company_address1").value %></li>
          <% if Preference.find_by(setting: "company_address2").value.present? %>
            <li><%= Preference.find_by(setting: "company_address2").value %></li>
          <% end %>
          <li><%= Preference.find_by(setting: "company_city").value %>
            , <%= Preference.find_by(setting: "company_prov").value %></li>
          <li><%= Preference.find_by(setting: "company_postalcode").value %></li>
          <li><%= Preference.find_by(setting: "company_country").value %></li>
          <li>
            <i class="fa-solid fa-phone"></i> <%= Preference.find_by(setting: "company_phone").value %>
---
SELECT "preferences".* FROM "preferences" WHERE "preferences"."setting" = $1 LIMIT $2  [["setting", "comapny_name"], ["LIMIT", 1]]
SELECT "preferences".* FROM "preferences" WHERE "preferences"."setting" = $1 LIMIT $2  [["setting", "company_address1"], ["LIMIT", 1]]
SELECT "preferences".* FROM "preferences" WHERE "preferences"."setting" = $1 LIMIT $2  [["setting", "company_address2"], ["LIMIT", 1]]
SELECT "preferences".* FROM "preferences" WHERE "preferences"."setting" = $1 LIMIT $2  [["setting", "company_city"], ["LIMIT", 1]]
SELECT "preferences".* FROM "preferences" WHERE "preferences"."setting" = $1 LIMIT $2  [["setting", "company_prov"], ["LIMIT", 1]]
SELECT "preferences".* FROM "preferences" WHERE "preferences"."setting" = $1 LIMIT $2  [["setting", "company_postalcode"], ["LIMIT", 1]]
SELECT "preferences".* FROM "preferences" WHERE "preferences"."setting" = $1 LIMIT $2  [["setting", "company_country"], ["LIMIT", 1]]
SELECT "preferences".* FROM "preferences" WHERE "preferences"."setting" = $1 LIMIT $2  [["setting", "company_phone"], ["LIMIT", 1]]

  <div class="text-center p-4" style="background-color: rgba(0, 0, 0, 0.2);">
    <p><%= Preference.find_by(setting: "copyright").value %></p>
---
SELECT "preferences".* FROM "preferences" WHERE "preferences"."setting" = $1 LIMIT $2  [["setting", "copyright"], ["LIMIT", 1]]