app/views/layouts/_header.html.erb

      <%= link_to root_path, class: 'navbar-brand' do %>
        <i class="fa-solid fa-camera"></i> <%= Preference.find_by(setting: "company_name").value %>
---
SELECT "preferences".* FROM "preferences" WHERE "preferences"."setting" = $1 LIMIT $2  [["setting", "company_name"], ["LIMIT", 1]]