app/views/layouts/_price.html.erb

SELECT "preferences".* FROM "preferences" WHERE "preferences"."setting" = $1 LIMIT $2  [["setting", "currency"], ["LIMIT", 1]]
SELECT "preferences".* FROM "preferences" WHERE "preferences"."setting" = $1 LIMIT $2  [["setting", "product_no_price"], ["LIMIT", 1]]
---
  <% if list_price.present? && list_price > 0 %>
    <del><%= Preference.find_by(setting: "currency").value %><%= list_price %></del>
    <strong class="text-success"><%= Preference.find_by(setting: "currency").value %><%= price %></strong>
  <% else %>
    <%= Preference.find_by(setting: "currency").value %><%= price %>

SELECT "preferences".* FROM "preferences" WHERE "preferences"."setting" = $1 LIMIT $2  [["setting", "product_no_price"], ["LIMIT", 1]]
---
<% else %>
  <%= Preference.find_by(setting: "product_no_price").value %>